# Перекладаємо слова на абетку Морзе
MORZE_DICT = {
    'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.',
    'G': '--.', 'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..',
    'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.',
    'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
    'Y': '-.--', 'Z': '--..', '0': '-----', '1': '.----', '2': '..---',
    '3': '...--', '4': '....-', '5': '.....', '6': '-....', '7': '--...',
    '8': '---..', '9': '----.'
}

def convert_to_morze(text: str) -> str:
    result = []
    text = text.upper()  # переводимо строку до верхнього регістру
    for s in text:
        if s in MORZE_DICT:
            result.append(MORZE_DICT.get(s))  # s == G

    return '====='.join(result)


text = input('Введіть строку (Enter для завершення): ')

print(convert_to_morze(text))
